{
  "name": "M Umair Amjad",
  "status": "Full Stack Developer",
  "description": " I am passionate Full Stack Developer with expertise in the MERN stack and WordPress development. I love building dynamic, user-friendly web applications and solving complex problems through code. With a strong foundation in Computer Science and hands-on experience in both frontend and backend technologies, I strive to create seamless digital experiences. Always eager to learn and grow, I'm on a mission to craft innovative solutions that make an impact. 🚀",
  "navigations": [
    {
      "id": 1,
      "name": "Home",
      "url": "/"
    },
    {
      "id": 2,
      "name": "Projects",
      "url": "/projects"
    },
    {
      "id": 4,
      "name": "Experiences",
      "url": "/experiences"
    },
    {
      "id": 3,
      "name": "Education",
      "url": "/education  "
    },
    {
      "id": 5,
      "name": "About",
      "url": "/about"
    },
    {
      "id": 6,
      "name": "Contact",
      "url": "/contact"
    }
  ],
  "services": [
    {
      "id": 2,
      "name": "Custom Website dev",
      "description": "Offering custom website development using the MERN stack and other modern technologies. From dynamic web apps to scalable business solutions, I build fast, secure, and fully customized websites tailored to your specific needs",
      "icon": "/services/service-website.svg"
    },
    {
      "id": 1,
      "name": "Wordpress Websites",
      "description": "Offering professional WordPress development using Elementor, WooCommerce, and more to create custom, responsive, and high-performance websites. Whether it's a business site or an eCommerce store, I build fast and user-friendly solutions tailored to your needs",
      "icon": "/services/service-website.svg"
    },
    {
      "id": 3,
      "name": "WebApps dev",
      "description": "Offering Web App development using modern technologies to create fast, secure, and scalable applications. Whether you need a business tool, a SaaS platform, or a custom web solution, I build responsive and high-performance web apps tailored to your needs",
      "icon": "/services/service-webapps.svg"
    },
    {
      "id": 1,
      "name": "Mobile Apps",
      "description": "Offering mobile app development using React Native, MERN stack, MongoDB, and custom APIs. From cross-platform apps to backend integration, I build fast, scalable, and user-friendly mobile solutions tailored to your needs.",
      "icon": "/services/service-rwd.svg"
    },
    {
      "id": 4,
      "name": "Responsive design",
      "description": "Develop a good Frontend design for mobile, tablet, desktop and all screen devices",
      "icon": "/services/service-rwd.svg"
    }
  ],
  "skills": [
    {
      "id": 20,
      "name": "Mongo DB",
      "icon": "/skills/mongodb.png"
    },
    {
      "id": 20,
      "name": "Express JS",
      "icon": "/skills/express.png"
    },
    {
      "id": 7,
      "name": "React JS",
      "icon": "/skills/skill-reactjs.svg"
    },
    {
      "id": 20,
      "name": "Node JS",
      "icon": "/skills/nodejs.png"
    },
    {
      "id": 7,
      "name": "React Native",
      "icon": "/skills/react-native.svg"
    },
    {
      "id": 3,
      "name": "Javascript",
      "icon": "/skills/skill-javascript.svg"
    },
    {
      "id": 8,
      "name": "Next JS",
      "icon": "/skills/skill-nextjs.svg"
    },
    {
      "id": 8,
      "name": "Python",
      "icon": "/skills/python.png"
    },
    {
      "id": 1,
      "name": "HTML 5",
      "icon": "/skills/skill-html5.svg"
    },
    {
      "id": 2,
      "name": "CSS 3",
      "icon": "/skills/skill-css3.svg"
    },
    {
      "id": 7,
      "name": "Wordpress",
      "icon": "/skills/wordpress.svg"
    },
    {
      "id": 5,
      "name": "PHP",
      "icon": "/skills/php.svg"
    }
  ],
  "project": {
    "title": "Project",
    "desctiption": "Some of the projects that I've worked on......",
    "contents": [
      {
        "id": 1,
        "top": false,
        "width": "280",
        "image": "/projects/ModelPlatform1.png",
        "image2": "/projects/ModelPlatform2.png",
        "image3": "/projects/ModelPlatform3.png",
        "image4": "/projects/ModelPlatform4.png",
        "image5": "/projects/ModelPlatform5.png",
        "name": "Expense/Budget Tracker",
        "description": "The Expense/Budget Tracker is a web-based application designed to help users manage their expenses and budgets efficiently. Users can log in, create expense categories, set budgets for each category, and record their expenses. The system provides a detailed dashboard that displays essential information, including the available budget for each category and an overall summary of expenses and budgets.",
        "stack": "React JS, CSS, Google API",
        "category": "Personal Project",
        "url": ""
      },
      {
        "id": 2,
        "top": true,
        "width": "150",
        "image": "/projects/Spis.png",
        "image2": "/projects/Spis.png",
        "name": "SPIS",
        "description": "SPIS is a revolutionary mobile application designed to transform the way users buy and sell pre-owned smartphones. It is similar to (OLX or Ebay) type platform, but just for smartphones. In this fast-paced digital era, where smartphones have become an essential part of our lives, making informed decisions while purchasing or selling a device is crucial. Our app aims to bridge the gap between buyers and sellers by providing a secure and reliable platform with comprehensive inspection services.",
        "stack": "Full Stack (MERN), React Native, Expo ",
        "category": "University Project",
        "url": "https://www.youtube.com/watch?v=-qHiL5Rlm9I&list=PLcSQK0eT8c2hv0Yq8wfrrvf-dEvFRSODr"
      },
      {
        "id": 2,
        "top": true,
        "width": "250",
        "image": "/projects/AnalysisTool.png",
        "name": "Data Visualization & Analysis Tool",
        "description": "Data Visualization & Analysis Tool is a powerful Python-based application designed to simplify data processing and enhance decision-making. Built using the Pandas library, it allows users to import, clean, and analyze data from corporate Excel sheets. The tool converts raw data into clear, insightful graphs and tables, making complex information easier to understand. With an intuitive interface and automated processing, it helps management quickly identify trends, patterns, and key insights for better business decisions. Ideal for organizations handling large datasets, this tool streamlines data analysis, improving efficiency and accuracy in reporting.",
        "stack": "React JS, Python, Django, Pandas Library ",
        "category": "Client's Project",
        "url": ""
      },
      {
        "id": 3,
        "top": true,
        "width": "280", 
        "image": "/projects/Ons1.png",
        "image2": "/projects/Ons2.png",
        "name": "ONS Grocery Store",
        "description": "ONS Grocery Store is an Wordpress WooCommerce store offering a online grocery ordering. The website features are modern and user-friendly design, allowing customers to easily browse through categories, find products offered by store, and complete cart purchases with easy google map location selector for delivery with a custom admin panel for admins that also allow to set limited access for store workers.The store's seamless online shopping experience ensures customers enjoy smooth navigation, secure payments, and fast delivery, making it the go-to destination for thier groceries.",
        "stack": "Wordpress",
        "category": "Client's Project",
        "url": "https://store.ons.sa"
      },

      {
        "id": 2,
        "top": true,
        "width": "280",
        "image": "/projects/cc1.png",
        "image2": "/projects/cc2.png",
        "name": "Outfit Managet and Recomendation",
        "description": "Outfit Manager and Recommendation is a MERN stack web application designed for individuals who want to efficiently manage their wardrobe and simplify outfit selection. Users can add, categorize, and organize their clothing items while receiving personalized recommendations. By selecting the season, occasion, and clothing type, they can generate outfit ideas that match their preferences. This platform is perfect for those who struggle with daily outfit choices or want to maximize their wardrobe’s potential. With a user-friendly interface, secure authentication, and a responsive design, it provides a seamless experience for effortless outfit planning and management",
        "stack": "Full Stack (MERN), Tailwind CSS",
        "category": "Client's Project",
        "url": ""
      },
      
      {
        "id": 5,
        "top": true,
        "width": "270",
        "image": "/projects/Marham.png",
        "name": "Marham Clone",
        "description": "The Marham Clone project is a web-based platform designed to facilitate the process of scheduling doctor's appointments for users. The system allows users to register and browse through various categories of doctors. Users can then select a doctor based on their specialization and book an available appointment slot. On the other side, doctors can register, manage their appointments, and provide necessary recommendations or precautions to the patients.",
        "stack": "PHP, MySqli, HTML, CSS, Java Script",
        "category": "Client's Project",
        "url": ""
      },

      {
        "id": 6,
        "top": false,
        "width": "280",
        "image": "/projects/MS_Traders.png",
        "image2": "/projects/Shopify2.png",
        "name": "Complete POS System",
        "description": "The Stock Management and Invoicing System is a comprehensive business management solution designed for local businesses. This project facilitates the efficient management of inventory, purchasing, sales, and invoicing. It empowers the business owner to keep track of product categories, available products, quantities, and detailed records of both purchases from manufacturers and sales to retailers or end customers.",
        "stack": "PHP, MySqli, HTML, CSS, Java Script",
        "category": "Client's Project",
        "url": ""
      },
      {
        "id": 7,
        "top": false,
        "width": "280",
        "image": "/projects/Expense.png",
        "image2": "/projects/Shopify2.png",
        "name": "Expense/Budget Tracker",
        "description": "The Expense/Budget Tracker is a web-based application designed to help users manage their expenses and budgets efficiently. Users can log in, create expense categories, set budgets for each category, and record their expenses. The system provides a detailed dashboard that displays essential information, including the available budget for each category and an overall summary of expenses and budgets.",
        "stack": "React JS, CSS, Google API",
        "category": "Personal Project",
        "url": ""
      }
      
    ]
  },
  "contact": {
    "title": "Contact",
    "description": "Chat with me through some of the contacts you can call to get acquainted.",
    "contents": [
      {
        "id": 1,
        "color": "#008080",
        "icon": "fab fa-whatsapp",
        "name": "WhatsApp",
        "username": "+92 3015935773",
        "category": "Social Media",
        "url": "https://wa.me/+923015935773"
      },
      {
        "id": 2,
        "color": "#008080",
        "icon": "fab fa-instagram",
        "name": "Instagram",
        "username": "@i.am.umair.ik.hi",
        "category": "Social Media",
        "url": "https://www.instagram.com/i.am.umair.ik.hi/"
      },
      {
        "id": 5,
        "color": "#008080",
        "icon": "fab fa-linkedin-in",
        "name": "Linkedin",
        "username": "M Umair Amjad",
        "category": "Social Media",
        "url": "https://www.linkedin.com/in/full-stack-dev-muhammad"
      },
      {
        "id": 7,
        "color": "#008080",
        "icon": "far fa-envelope",
        "name": "Gmail",
        "username": "official.umairamjad@gmail.com",
        "category": "Email",
        "url": "mailto:official.umairamjad@gmail.com"
      }
    ]
  },
  "about": {
    "title": "About",
    "description": "Explore my journey, skills, and aspirations as a Full Stack Developer.",
    "contents": [
      {
        "id": 1,
        "name": "My History",
        "description": "I started my journey as a Full Stack Developer with a strong foundation in Computer Science. Over the years, I have honed my skills in MERN stack development and WordPress customization. With experience in both freelance and professional roles, I have worked on diverse projects, from dynamic web applications to custom business websites. My passion for building user-friendly digital experiences continues to drive my growth in the field."
      },
      {
        "id": 2,
        "name": "What am I Doing",
        "description": "I'm currently immersed in the world of full stack development. At Takafu Technologies, I lead projects where I build advanced data visualization and analysis tools using Python and React. Alongside my role there, I also take on freelance projects—developing robust web applications with the MERN stack and creating tailored WordPress solutions. My work is all about crafting innovative digital experiences that are both high-performing and user-friendly"
      },
      {
        "id": 3,
        "name": "Looking Forward",
        "description": "I'm available for opportunities that allow me to grow both financially and in experience. I’m eager to join a dynamic, innovative work environment where I can further develop my skills, take on new challenges, and contribute to meaningful projects"
      },
      {
        "id": 4,
        "name": "My Motivation",
        "description": "I love to code -------> because I enjoy solving challenges and creating innovative solutions.<br/>I love this field -------> because it inspires me to learn, evolve, and embrace continuous growth.<br/><br/>Every line of code is a new opportunity to innovate, and my passion for this craft makes me the driven, forward-thinking choice for any team"
      }
    ]
  },
  "resume": {
    "title": "Education",
    "description": "Explore my experiences, rewards, education, and my active involvement in Full Stack Development.",
    "contents": [
      {
        "id": 3,
        "title": "Educational Background",
        "contents": [
          {
            "id": 1,
            "timestamp": "2019 - 2023",
            "name": "Bachelor of Computer Science",
            "info": "NFC University, Affiliated with UET Lahore",
            "description": "I earned my Bachelor's in Computer Science, focusing on Data Structures, Algorithms, AI, Machine Learning, Cloud Computing, and Programming. During my studies, I honed my skills in Python, C++, and JavaScript, equipping myself for software development roles and practical applications."
          },
          {
            "id": 2,
            "timestamp": "2017 - 2019",
            "name": "FSc Pre-Engineering",
            "info": "Unique College",
            "description": "I completed my pre-university education at Unique College, where I gained a solid foundation in core scientific and engineering principles, preparing me for higher education in Computer Science."
          },
          {
            "id": 3,
            "timestamp": "- 2017",
            "name": "Matriculation",
            "info": "Unique High School",
            "description": "I graduated from Unique High School, where I completed my matriculation and developed a strong academic base in science and mathematics."
          }
        ]
      }
    ]
  }
}